# Titanic Dataset

## Part I: Exploratory Analysis

Lets begin by importing pandas and reading the titanic dataset that shows the passengers and their survival based on a series of features.

In [1]:
import pandas as pd

Read the dataset correctly using pandas, using an appropriate column as index.
The appropriate column to use as index is the PassengerId because it gives each passenger a unique identifier that we can then use for our analysis.

In [173]:
tit_df = pd.read_csv("C:/Users/alain/OneDrive/Desktop/MBD/Term 2 (Python)/1. Python (20)/Individual Assignment/train.csv",
                     index_col = "PassengerId") # use PassengerId as column index
tit_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [102]:
tit_df["Embarked"].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

### Now, lets try to compute the percentage of survivors out of total number of passengers and the percentage of men and women out of total number of passengers.

Percentage of survivors out of total passengers:

In [104]:
percentage = ((tit_df.loc[
    (tit_df["Survived"]==1), 
    "Survived"
].count())/(tit_df["Survived"].count())*100).round(2) # .loc locates the rows (passengers) with 1 on the Survived column (survivors)
                                        # .count counts the rows with the located conditions
print("Only", percentage,"% of the passengers on the Titanic survived!")

Only 38.38 % of the passengers on the Titanic survived!

Percentage of men out of total number of passengers

In [105]:
percentage1 = ((tit_df.loc[
    (tit_df["Sex"]=="male"),
    "Sex"
].count())/(tit_df["Survived"].count())*100).round(2) # .loc locates the rows (passengers) with "male" on the Sex column (men)
                                        # .count counts the rows with the located conditions
print(percentage1,"% of the passengers were men")

64.76 % of the passengers were men

Percentage of women out of total number of passengers

In [106]:
percentage2 = ((tit_df.loc[
    (tit_df["Sex"]=="female"),
    "Sex"
].count())/(tit_df["Survived"].count())*100).round(2) # .loc locates the rows (passengers) with "female" on the Sex column (women)
                                        # .count counts the rows with the located conditions
print(percentage2,"% of the passengers were women")

35.24 % of the passengers were women

Almost 2/3 of the passengers were men!

### Now lets compute the percentage of survivors by sex (i.e. the percentage of male passengers that survived and female passengers that survived) and the sex distribution of survivors (i.e. percentage of survivors that were men and percentage of survivors that were women)

Percentage of Male Survivors

In [107]:
percentage3 = (((tit_df.loc[
    (tit_df["Sex"]=="male") & (tit_df["Survived"]==1),
    "Sex"
].count())/
               ((tit_df.loc[
    (tit_df["Sex"]=="male"),
    "Sex"
].count())))*100).round(2) # .loc locates the rows (passengers) with "male" on the Sex column (men) and 
                           #   that have 1 on the Survivor column (survived)
                           # .count counts the rows with the located conditions
print(percentage3,"% of the men on the Titanic survived")

18.89 % of the men on the Titanic survived

Percentage of Female Survivors

In [108]:
percentage4 = (((tit_df.loc[
    (tit_df["Sex"]=="female") & (tit_df["Survived"]==1),
    "Sex"
].count())/
               ((tit_df.loc[
    (tit_df["Sex"]=="female"),
    "Survived"
].count())))*100).round(2) # .loc locates the rows (passengers) with "female" on the Sex column (women) and 
                           #   that have 1 on the Survivor column (survived)
                           # .count counts the rows with the located conditions
print(percentage4,"% of the women on the Titanic survived")

74.2 % of the women on the Titanic survived

Percentage survivors that were men

In [109]:
percentage5 = (((tit_df.loc[
    (tit_df["Sex"]=="male") & (tit_df["Survived"]==1),
    "Sex"
].count())/
               ((tit_df.loc[
    (tit_df["Survived"]==1),
    "Survived"
].count())))*100).round(2) # .loc locates the rows (passengers) with "male" on the Sex column (men) and 
                           #   that have 1 on the Survivor column (survived)
                           # .count counts the rows with the located conditions
print("After the Titanic being 2/3 men, only", percentage5,"% of the Titanic survivors were men!")

After the Titanic being 2/3 men, only 31.87 % of the Titanic survivors were men!

Percentage survivors that were women

In [110]:
percentage5 = (((tit_df.loc[
    (tit_df["Sex"]=="female") & (tit_df["Survived"]==1),
    "Sex"
].count())/
               ((tit_df.loc[
    (tit_df["Survived"]==1),
    "Survived"
].count())))*100).round(2)            # .loc locates the rows (passengers) with "female" on the Sex column (women) and 
                           #   that have 1 on the Survivor column (survived)
                           # .count counts the rows with the located conditions
print(percentage5,"% of the Titanic survivors were women")

68.13 % of the Titanic survivors were women

This gives us some insight into what was happening. Before the accident, the sex distribution favored males at almost 2/3, but once it was all said and done the sex distribution favored women at over 2/3! This has some explanation in that women and children were

### Display in a 2 x 2 DataFrame the probability of being male/female and surviving/not surviving

Male & Survived

In [111]:
percentage6 = ((tit_df.loc[
    (tit_df["Sex"]=="male") & (tit_df["Survived"]==1),
    "Sex"
].count())/
              (tit_df["Survived"].count())).round(4)         # .loc locates the rows (passengers) with "male" on the Sex column (men) and 
                           #   that have 1 on the Survivor column (survived)
                           # .count counts the rows with the located conditions
print("Probability of being male and survivor:", percentage6)

Probability of being male and survivor: 0.1223

Male & Not Survived

In [112]:
percentage7 = ((tit_df.loc[
    (tit_df["Sex"]=="male") & (tit_df["Survived"]==0),
    "Sex"
].count())/
              (tit_df["Survived"].count())).round(4) # .loc locates the rows (passengers) with "male" on the Sex column (men) and 
                           #   that have 1 on the Survivor column (did not survive)
                           # .count counts the rows with the located conditions
print("Probability of being male and survivor:", percentage7)

Probability of being male and survivor: 0.5253

Female & Survived

In [113]:
percentage8 = ((tit_df.loc[
    (tit_df["Sex"]=="female") & (tit_df["Survived"]==1),
    "Sex"
].count())/
              (tit_df["Survived"].count())).round(4) # .loc locates the rows (passengers) with "female" on the Sex column (women) and 
                           #   that have 1 on the Survivor column (survived)
                           # .count counts the rows with the located conditions
print("Probability of being female and survivor:", percentage8)

Probability of being female and survivor: 0.2615

Female & Not Survived

In [114]:
percentage9 = ((tit_df.loc[
    (tit_df["Sex"]=="female") & (tit_df["Survived"]==0),
    "Sex"
].count())/
              (tit_df["Survived"].count())).round(4) # .loc locates the rows (passengers) with "female" on the Sex column (women) and 
                           #   that have 0 on the Survivor column (did not survive)
                           # .count counts the rows with the located conditions
print("Probability of being female and survivor:", percentage9)

Probability of being female and survivor: 0.0909

2x2 Probability DataFrame

Lets create a display function to make this table look nice.

In [115]:
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

In [116]:
probs = [[percentage6, percentage7], [percentage8, percentage9]]
probabilities = pd.DataFrame(probs, columns =['Survived', 'Not Survived'], index = ['Male','Female'])
display("probabilities")

probabilities
        Survived  Not Survived
Male      0.1223        0.5253
Female    0.2615        0.0909

## Part II: Imputing Missing Values

Lets first check where are the missing values

In [174]:
tit_df.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

Ok, so the features Age and Cabin have most of the missing values. The Embarked feauture only has 2 missing values.

### Imputing the Age Feature

In this analysis we will focus on imputing the missing values from the Age feature.

In [175]:
tit_df.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [176]:
tit_df["Age"].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

By looking at the dataset's description, we can see that the average is around 30, as expected. However, the minimum is at 0.42, which is dubious and the maximum is at 80 years-old which sounds reasonable. Upon looking on Google, we can see that Mellvina Dean was supposedly the youngest person on board the Titanic as a 2 months-old baby.

In [177]:
tit_df[tit_df["Age"]<1].count()

Survived    7
Pclass      7
Name        7
Sex         7
Age         7
SibSp       7
Parch       7
Ticket      7
Fare        7
Cabin       1
Embarked    7
dtype: int64

Here, we can see that there were 7 babies on board. Therefore, we can now proceed knowing that the dataset does not hold incorrect outlier data.

### Imputation Strategy

The strategy devised for the Age feature imputation process is to first look at the age averages of survivors, and different sex, with the objective of making valuable and reasonable imputations depending on their other attributes. To illustrate the importance of this, for instance, in a catastrophe like the Titanic survivors age average will be lower because once mayhem kicks in, the men will make sure the younger people survive, as they have a longer life ahead of them. On the same note, the female sex usually is preserved in this type of catastrophe with the objective of preserving the human race (women are the ones that can have and raise a child). Lets take a look at these two features.

In [178]:
tit_df["Sex"] = tit_df["Sex"].replace("male",1)
tit_df["Sex"] = tit_df["Sex"].replace("female",0)
tit_df.tail()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
887,0,2,"Montvila, Rev. Juozas",1,27.0,0,0,211536,13.00,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",0,19.0,0,0,112053,30.00,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",0,NaN,1,2,W./C. 6607,23.45,NaN,S
890,1,1,"Behr, Mr. Karl Howell",1,26.0,0,0,111369,30.00,C148,C
891,0,3,"Dooley, Mr. Patrick",1,32.0,0,0,370376,7.75,NaN,Q

Sex male is 1

Sex female is 0

In [179]:
Avg_age_men_survived = tit_df.loc[(tit_df["Survived"]==1) & (tit_df["Sex"]==1), "Age"].mean()
print("The average age of the male survivors was", Avg_age_men_survived, "years old")

The average age of the male survivors was 27.276021505376345 years old

In [180]:
Avg_age_men_dead = tit_df.loc[(tit_df["Survived"]==0) & (tit_df["Sex"]==1), "Age"].mean()
print("The average age of the dead men was", Avg_age_men_dead, "years old")

The average age of the dead men was 31.618055555555557 years old

In [181]:
Avg_age_women_survived = tit_df.loc[(tit_df["Survived"]==1) & (tit_df["Sex"]==0), "Age"].mean()
print("The average age of the female survivors was", Avg_age_women_survived, "years old")

The average age of the female survivors was 28.84771573604061 years old

In [182]:
Avg_age_women_dead = tit_df.loc[(tit_df["Survived"]==0) & (tit_df["Sex"]==0), "Age"].mean()
print("The average age of the dead women was", Avg_age_women_dead, "years old")

The average age of the dead women was 25.046875 years old

One can see a trend based on the dead men and women, the average for dead men is 6.6 years over dead women in the Titanic. This is further evidence of our previous hypothesis. 

Anyway, we will continue now to impute the null values based on these criteria.

## Imputing using the 4 means of the combinations of both features Sex and Survived

### Imputting Male survivor's Age nulls with Male survivor's mean Age

In [192]:
tit_df.loc[(tit_df["Sex"] == 1) 
           & (tit_df["Survived"] == 1) 
           & (tit_df["Age"].isnull())
           ,"Age"] = Avg_age_men_survived

In [197]:
tit_df.loc[(tit_df["Sex"]==1) & (tit_df["Survived"]==1)].head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
18,1,2,"Williams, Mr. Charles Eugene",1,27.276022,0,0,244373,13.0000,NaN,S
22,1,2,"Beesley, Mr. Lawrence",1,34.000000,0,0,248698,13.0000,D56,S
24,1,1,"Sloper, Mr. William Thompson",1,28.000000,0,0,113788,35.5000,A6,S
37,1,3,"Mamee, Mr. Hanna",1,27.276022,0,0,2677,7.2292,NaN,C
56,1,1,"Woolner, Mr. Hugh",1,27.276022,0,0,19947,35.5000,C52,S

Looks like it worked! Now lets do it for the rest of the conditions

### Imputting Female survivor's Age nulls with Female survivor's mean Age

In [194]:
tit_df.loc[(tit_df["Sex"] == 0) 
           & (tit_df["Survived"] == 1) 
           & (tit_df["Age"].isnull())
           ,"Age"] = Avg_age_women_survived

In [202]:
tit_df.loc[(tit_df["Sex"]==0) & (tit_df["Survived"]==1)].head(10)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.000000,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",0,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.000000,1,0,113803,53.1000,C123,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0,27.000000,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",0,14.000000,1,0,237736,30.0708,NaN,C
11,1,3,"Sandstrom, Miss. Marguerite Rut",0,4.000000,1,1,PP 9549,16.7000,G6,S
12,1,1,"Bonnell, Miss. Elizabeth",0,58.000000,0,0,113783,26.5500,C103,S
16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",0,55.000000,0,0,248706,16.0000,NaN,S
20,1,3,"Masselmani, Mrs. Fatima",0,28.847716,0,0,2649,7.2250,NaN,C
23,1,3,"McGowan, Miss. Anna ""Annie""",0,15.000000,0,0,330923,8.0292,NaN,Q

### Imputting Dead Men Age nulls with Dead Men mean Age

In [203]:
tit_df.loc[(tit_df["Sex"] == 1) 
           & (tit_df["Survived"] == 0) 
           & (tit_df["Age"].isnull())
           ,"Age"] = Avg_age_men_dead

In [204]:
tit_df.loc[(tit_df["Sex"]==1) & (tit_df["Survived"]==0)].head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",1,22.000000,1,0,A/5 21171,7.2500,NaN,S
5,0,3,"Allen, Mr. William Henry",1,35.000000,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",1,31.618056,0,0,330877,8.4583,NaN,Q
7,0,1,"McCarthy, Mr. Timothy J",1,54.000000,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",1,2.000000,3,1,349909,21.0750,NaN,S

### Imputting Dead Women Age nulls with Dead Women mean Age

In [206]:
tit_df.loc[(tit_df["Sex"] == 0) 
           & (tit_df["Survived"] == 0) 
           & (tit_df["Age"].isnull())
           ,"Age"] = Avg_age_women_dead

In [208]:
tit_df.loc[(tit_df["Sex"]==0) & (tit_df["Survived"]==0)].tail()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
855,0,2,"Carter, Mrs. Ernest Courtenay (Lilian Hughes)",0,44.000000,1,0,244252,26.0000,NaN,S
864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",0,25.046875,8,2,CA. 2343,69.5500,NaN,S
883,0,3,"Dahlberg, Miss. Gerda Ulrika",0,22.000000,0,0,7552,10.5167,NaN,S
886,0,3,"Rice, Mrs. William (Margaret Norton)",0,39.000000,0,5,382652,29.1250,NaN,Q
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",0,25.046875,1,2,W./C. 6607,23.4500,NaN,S

### Now lets see if there are any missing values in the Age feature.

In [212]:
tit_df.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age           0
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [213]:
tit_df["Age"].isnull().sum()

0

Nope, looks like we have cleaned the missing values out with a valid hypothesis for imputting those missing values.

This means there is not more work to be done today, see you next time!

Juan Luis, I would like to thank you for this assignment, it was really great practice for me. 

Alain Grulln Gonzlez